RIET/src/AccumulationRegisters/ExportItemsWithoutCustomsFiles/ExportItemsWithoutCustomsFiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ExportItemsWithoutCustomsFiles</name>
  <resources>
    <name>Ресурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Item</name>
    <type>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ExportRequest</name>
    <type>
      <types>DocumentRef.ExportRequest</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ExportShipment</name>
    <type>
      <types>DocumentRef.ExportShipment</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/ExportItemsWithoutCustomsFiles/RecordSetModule.bsl
Процедура ДобавитьЗапись(ВидДвижения, Период, Item, ExportRequest, ExportShipment) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВидДвижения) Тогда
		ВызватьИсключение "Вид движения is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		ВызватьИсключение "Период is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Item) Тогда
		ВызватьИсключение "Item is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ExportRequest) Тогда
		ВызватьИсключение "Export request is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ExportShipment) Тогда
		ВызватьИсключение "Export shipment is empty!";
	КонецЕсли;
	
	Движение = Добавить();
	Движение.ВидДвижения = ВидДвижения;
	Движение.Период = Период;
	Движение.Item = Item;	
	Движение.ExportRequest = ExportRequest;
	Движение.ExportShipment = ExportShipment;	
	Движение.Ресурс = 1;
	
КонецПроцедуры
